# შექმენით ფუნქცია სახელად manual_pop, რომელსაც გადაეცემა სია და ასევე შესაძლოა ინდექსი.
#  როდესაც გადაეცემა ინდექსი, სიიდან უნდა ამოიშალოს ამ ინდექსზე მყოფი ელემენტი და დაბრუნდეს სია ამ სახით.
# თუ ფუნქციას არ გადაეცემა index, მაშინ default მნიშვნელობა უნდა იყოს სიის ბოლო ელემენტი - 
# ზოგადად pop როგორც მუშაობს. ამ დავალებაში რათქმაუნდა pop არ უნდა გამოიყენოთ

def manual_pop(listn, indx = -1):
    listm = []
    for i in range(0,len(listn)):
        if i != indx:
            listm.append(i)
    return listm

print(manual_pop([1,2,3,4,5],1))
print(manual_pop([1,2,3,4,5],()))



# შექმენით ფუნქცია სახელად manual_count: ფუნქციას გადაეცემა სია და ასევე შესაძლოა ელემენტი. როდესაც ფუნქციას 
# ელემენტიც გადაეცემა, თქვენ უნდა დაითვალოთ სიაში ამ ელემენტის რაოდენობა, არ გამოიყენოთ count. როდესაც არ 
# გადაეცემა ელემენტი, მისთვის გამოიყენეთ default მნიშვნელობა და გაუტოლეთ საწყისი სიის საშუალო არითმეტიკულს,
# ოღონდ მთელი რიცხვის სახით (int(აქ საშუალოს კოდი)).

def manual_counter(arr, num = int(sum([1,7,3,4,4,5,6,7,4])/len([1,7,3,4,4,5,6,7,4]))):
    counter = 0
    for i in arr:
        if i == num:
            counter += 1
    return counter
print(manual_counter([1,7,3,4,4,5,6,7,4], 4))
print(manual_counter([1,7,3,4,4,5,6,7,4], ()))



# შექმენით ფუნქცია სახელად manual_min, რომელსაც შესაძლოა გადაეცეს მთელი რიცხვების სია - გაიხსენეთ
# function default argument. თუ ფუნქციას სია გადაეცემა, დააბრუნეთ ამ სიის მინიმალური მნიშვნელობა,
# არ გამოიყენოთ min. თუ ფუნქციას არ გადაეცემა სია, მაშინ იმუშავეთ 1-იდან 10-ის ჩათვლით არსებული მთელი რიცხვების სიაზე.

def manual_min ( arr = [1,2,3,4,5,6,7,8,9,10]):
    a = arr[0]
    for i in arr:
        if i < a:
            a = i
    return a
print(manual_min([3,6,8,91,2]))
print(manual_min())




# # შექმენით ფუნქცია სახელად manual_max, რომელსაც შესაძლოა გადაეცეს მთელი რიცხვების სია - გაიხსენეთ function
# # default argument. თუ ფუნქციას სია გადაეცემა, დააბრუნეთ ამ სიის მაქსიმალური მნიშვნელობა, არ გამოიყენოთ max.
# # თუ ფუნქციას არ გადაეცემა სია, მაშინ იმუშავეთ 1-იდან 10-ის ჩათვლით არსებული მთელი რიცხვების სიაზე.


def manual_max ( arr = [1,2,3,4,5,6,7,8,9,10]):
    y = arr[0]
    for x in arr:
        if x > y:
            y = x
    return y
print(manual_max([3,6,8,91,2]))
print(manual_max())



